# PointNode Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
PointNode Class
Members See Also
---
An output node that represents a 3D point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class PointNode : ModelCurveNode
```

Visual Basic
---
```text
Public Class PointNode _
	Inherits ModelCurveNode
```

Visual C++
---
```text
public ref class PointNode : public ModelCurveNode
```

# Remarks
See also: OnPoint(PointNode).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ModelCurveNode Autodesk.Revit.DB..::..PointNode
# See Also
PointNode Members
Autodesk.Revit.DB Namespace